scripts/ClaimProcessingHTTP/data/t3_RequestBody.txt

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><enterClaim xmlns="http://hp.com/SOAQ/ServiceSimulation/2010/demo/01"><claim xmlns:a="http://schemas.datacontract.org/2004/07/HP.SOAQ.ServiceSimulation.Demo" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:adjustedAmount>0</a:adjustedAmount><a:approvalStatus i:nil="true"/><a:approved>false</a:approved><a:claimedAmount>400</a:claimedAmount><a:date>2010-02-01T00:00:00</a:date><a:description>ear surgery</a:description><a:firstName>Sherlock</a:firstName><a:lastName>Holmes</a:lastName><a:memberId i:nil="true"/><a:reimbursed>false</a:reimbursed><a:socialSecurityNumber>332-10-0002</a:socialSecurityNumber></claim></enterClaim></s:Body></s:Envelope>